//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length>=3){
    console.log('це великий масив, в якому  3 і більше елементів')
}else {
    console.log('це маленький масив, в якому менше 3-х елементів')
}
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
//
//
//
//
//
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
let name=prompt('Яка «офіційна» назва JavaScript?')
if (name==='ECMAScript'){
    console.log('Правильно!');
}else{
    console.log('Не знаєте? ECMAScript!')
}
//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let home = +prompt('Введите номер кватиры');
if (home >= 1 && home <= 20) {
    console.log('Первый подъезд');
} else if (home >= 21 && home <= 48) {
    console.log('Второй подъезд');
} else if (home >= 49 && home <= 90) {
    console.log('Третий подъезд');
} else {
    console.log('Квартира не найдена')
}


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number=10;
if(number===10){
    console.log('Вірно');
}else {
    console.log('Не вірно')
}
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let temperature=+prompt('чи ми йдемо сьогодні в OKTEN на навчання?');
if (temperature>=+10&&temperature<=+22){
    console.log('Mи йдемо ВЧИТИСЯ')
}else {
    console.log('Сидимо вдома і вчимося ОНЛАЙН')
}
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let quiz = +prompt('Enter number');
switch (quiz) {
    case 1:
        console.log('You win the car');
        break;
    case 2:
        console.log('You win the motorbike');
        break;
    case 3:
        console.log('You win the mobile phone');
        break;
    case 4:
        console.log('You win a banana');
        break;
    case 5:
        console.log('You win a parrot');
        break;
    default:
        console.log('You lose');
}
